Revit 2027 API
ParameterTypeId.MepSegmentLength Property
 "Analytical Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepSegmentLength { get; }
Public Shared ReadOnly Property MepSegmentLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepSegmentLength {
	ForgeTypeId^ get ();
}
static member MepSegmentLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace